fio-test/results/write_out_16/512k-io_uring.out
job1: (g=0): rw=write, bs=(R) 512KiB-512KiB, (W) 512KiB-512KiB, (T) 512KiB-512KiB, ioengine=io_uring, iodepth=1
...
fio-3.28
Starting 8 processes

job1: (groupid=0, jobs=8): err= 0: pid=18947: Thu Jun 13 19:07:08 2024
  write: IOPS=8422, BW=4211MiB/s (4416MB/s)(673GiB/163669msec); 0 zone resets
    slat (usec): min=8, max=454, avg=28.16, stdev= 9.12
    clat (usec): min=216, max=2730, avg=918.55, stdev=133.95
     lat (usec): min=238, max=2773, avg=946.90, stdev=135.35
    clat percentiles (usec):
     |  1.00th=[  725],  5.00th=[  775], 10.00th=[  799], 20.00th=[  832],
     | 30.00th=[  848], 40.00th=[  873], 50.00th=[  898], 60.00th=[  922],
     | 70.00th=[  955], 80.00th=[  996], 90.00th=[ 1057], 95.00th=[ 1106],
     | 99.00th=[ 1287], 99.50th=[ 1778], 99.90th=[ 2114], 99.95th=[ 2180],
     | 99.99th=[ 2442]
   bw (  MiB/s): min= 3411, max= 4778, per=100.00%, avg=4218.84, stdev=39.43, samples=2612
   iops        : min= 6822, max= 9556, avg=8436.75, stdev=78.85, samples=2612
  lat (usec)   : 250=0.01%, 500=0.06%, 750=2.21%, 1000=78.04%
  lat (msec)   : 2=19.39%, 4=0.30%
  cpu          : usr=3.26%, sys=0.97%, ctx=1378592, majf=0, minf=1900
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1378560,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=4211MiB/s (4416MB/s), 4211MiB/s-4211MiB/s (4416MB/s-4416MB/s), io=673GiB (723GB), run=163669-163669msec

Disk stats (read/write):
    dm-0: ios=48/1378192, merge=0/0, ticks=4/1205976, in_queue=1205980, util=100.00%, aggrios=33/1378560, aggrmerge=6/0, aggrticks=2/85222, aggrin_queue=85225, aggrutil=100.00%
  nvme1n2: ios=32/1378560, merge=4/0, ticks=2/86200, in_queue=86202, util=100.00%
  nvme4n2: ios=34/1378560, merge=10/0, ticks=2/86625, in_queue=86626, util=100.00%
  nvme0n2: ios=38/1378560, merge=6/0, ticks=4/81298, in_queue=81302, util=100.00%
  nvme3n2: ios=28/1378560, merge=6/0, ticks=3/86013, in_queue=86016, util=100.00%
  nvme2n2: ios=34/1378560, merge=4/0, ticks=2/85976, in_queue=85979, util=100.00%